<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from tsms.kg.edu.yu/programiranje/zadaci_c/zadaci_nizovi.htm by HTTrack Website Copier/3.x [XR&CO'2004], Fri, 10 Aug 2007 12:29:20 GMT -->
<head>
<title>Programski jezik C: Zadaci Nizovi</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../Stilovi.css" rel="stylesheet" type="text/css">
</head>
<body bgcolor="#FFFFFF">
<p class="Tekst">1. Napi&scaron;i program koji formira niz od 1000 slu&#269;ajno odabranih elemenata iz intervala od 0 - 9999, i odre&#273;uje najve&#263;i element niza. (<a href="nizovi/NIZ1.C">Re&scaron;enje</a>)</p>
<p class="Tekst">2.  Napi&scaron;i program koji formira niz od 10000 slu&#269;ajno odabranih elemenata iz intervala od 0 - 999, i odre&#273;uje aritmeti&#269;ku sredinu parnih elemenata i aritmeti&#269;ku sredinu neparnih elemenata niza. (Re&scaron;enje)</p>
<p class="Tekst">3.  Napi&scaron;i program koji formira niz od 10  elemenata i odre&#273;uje minimalni elemenat niza kao i njegovu poziciju u nizu. (<a href="nizovi/NIZ3.C">Re&scaron;enje</a>)</p>
<p class="Tekst">4. Napi&scaron;i program koji formira niz od 10 elemenata i pripazuje na ekranu samo negativne elemente niza i njihove indekse. (Re&scaron;enje) </p>
<p class="Tekst">5. Slu&#269;ajnim izborom formiraj niz od n elemenata iz intervala 10 do 20, a zatim sumiraj parne elemente tog niza. (Re&scaron;enje) </p>
<p class="Tekst">6. Slu&#269;ajnim izborom formiraj niz od 20 elemenata iz intervala 0-100. Odredo MAX parnih elemenata i MIN neparnih elemenata niza. (<a href="nizovi/NIz6.C">Re&scaron;enje</a>) </p>
<p class="Tekst">7. Formirati slu&#269;ajnim izborom niz a[] od n elemenata iz intervala od 1 - 200. Iz takvog niza izdvojititi pod niz b[] koji &#263;e sadr&#382;ati samo dvocifrene brojeve niza a[]. (Re&scaron;enje) </p>
<p class="Tekst">8. Napi&scaron;i program koji slu&#269;ajnim izborom formira niz od 1000 elemenata iz intervala od 0 - 10000. Prikazati samo one elemente koji su deljivi sa 7 i 8. (Re&scaron;enje) </p>
<p class="Tekst">9. Napi&scaron;i program koji formira niz od <strong>n</strong> elemenata sli&#269;ajnim izborom brojeva od 0 do 99. Izra&#269;unati sumu parnih elemenata ve&#263;ih od 60. ( </p>
<p class="Tekst">10. Formiraj dva niza A[] i B[] od m i n elemenata. Tre&#263;i niz C[] se automatski formira od dva uneta niza tako &scaron;to svi parni elementi  nizova A i B postaju elementi tre&#263;eg niza. Prikazati elemente sva tri niza. (<a href="nizovi/ZNIZ10.C">Re&scaron;enje</a>).</p>
<p class="Tekst">11. Formiraj niz A[] od n sli&#269;ajno odabranih elemenata iz intervala od 0-100. Takav niz podeli na dva niza: niz B[] sadr&#382;i elemente manje od 50, niz C[] sadr&#382;i ostale elemente. (Re&scaron;enje) </p>
<p class="Tekst">&nbsp;</p>
<p class="Mali_naslov">Sortiranje nizova </p>
<p class="Tekst">1. Napi&scaron;i program koji formira niz od 10 celih brojeva, sortira ga u rastu&#263;em poredku i prebrojava koliki niz ima razli&#269;itih elemenata. (<a href="nizovi/N_sort1.c">Re&scaron;enje</a>) </p>
<p class="Tekst">2.Napi&scaron;i program koji formira niz od n elemenata, ra&#269;una njegovu sumu, sortira ga u opadaju&#263;i poredak i prikazuje tako sortiran niz. (Re&scaron;enje) </p>
<p class="Tekst">&nbsp;</p>
<p class="Mali_naslov">Dvodimenzioni nizovi - Matrice<a name="matrice"></a> </p>
<p class="Tekst">1. Napi&scaron;i program koji formira matricu dimenzija m x n, pa je zatim prikazuje slo&#382;enu po vrstama i kolonama. (<a href="nizovi/N_MAT1.C">Re&scaron;enje</a>) </p>
<p class="Tekst">2. Napi&scaron;i program koj formira matricu dimenzija m x n &#269;ije elemente bira slu&#269;ajnim izborom brojeva od 0-9, Prikazati matricu i sumu elemenata prve vrste te matrice. (<a href="nizovi/N_MAT2.C">Re&scaron;enje</a>)</p>
<p class="Tekst">3. Napi&scaron;i program koji formira matricu dimenzija n x n . Prikazati matricu i sumu elemenata na glavnoj dijagonali te matrice. (Re&scaron;enje)</p>
<p class="Tekst">4. Napisati program koji formira matricu dimenzija m x n. Prikazati matricu i prebroj koliko je elemenata u matrici jednako nuli. (<a href="nizovi/N_MAT4.C">Re&scaron;enje bez funkcija</a>, <a href="nizovi/N_MAT4A.C">Re&scaron;enje sa funkcijama</a>)</p>
<p class="Tekst">5. Napi&scaron;i program koji u&#269;itava dve matrice dimenzije m x n slu&#269;ajnim izborom elemenata (0-9). Izra&#269;unaj zbir te dve matrice i prikazati poruku u obliku</p>
<p class="Tekst">Martica A</p>
<p class="Tekst">......</p>
<p class="Tekst">Martica B</p>
<p class="Tekst">.........</p>
<p class="Tekst">Rezultat</p>
<p class="Tekst">........</p>
<p class="Tekst">(<a href="nizovi/N_MAT5.C">Re&scaron;enje</a>) </p>
<p class="Tekst">6. Formirati slu&#269;ajnim izborom niz N trouglova &#269;ije stranice su brojevi od 1 - 9, i proverava se uslov da li izabrane straanice mogu formirati trougao. izra&#269;unati povr&scaron;ine i obime trouglova. Prikazati formirane trouglove i izra&#269;unate podatke tih trouglova. (<a href="nizovi/N_mat6.C">Re&scaron;enje</a>) </p>
<p class="Tekst">6 a. Zadatak kao prethodni samo se niz trouglova sortira prema njihovoj povr&scaron;ini (<a href="nizovi/N_mat6a.C">Re&scaron;enje</a>) </p>
<p class="Tekst">6 b. Formirati slu&#269;ajnim izborom niz N trapeza &#269;ije stranice su brojevi od 1 - 9. Izra&#269;unati povr&scaron;ine i obime trapeza. Prikazati formirane trapeze i izra&#269;unate podatke tih trapeza. (<a href="nizovi/n_mat6b.c">Re&scaron;enje</a>) </p>
<p class="Tekst">7. Napisati program koji formira matricu dimenzije <strong>m</strong> x <strong>n</strong> &#269;ije elemente bira slu&#269;ajnim izborom brojeva od 0 do 9. Izra&#269;unati sumu parnih elemenata, i prebrojati koliko je elemenata jednako nuli, pa zatim prikazati matricu i dobijene rezultate. (<a href="nizovi/n_mat7.C">Re&scaron;enje</a>) </p>
<p class="Tekst">8. Napisati program koji formira matricu dimenzije <strong>m </strong>x <strong>n. </strong>Izra&#269;unati sumu elmenata matrice i prikazati matricu. (Re&scaron;enje) </p>
<p class="Tekst">9. Napi&scaron;i program koji formira matricu dimenzija<strong> n x n</strong> . Prikazati matricu i sumu elemenata svake vrste te matrice. (<a href="nizovi/n_mat9.c">Re&scaron;enje</a>)</p>
<p class="Tekst">10. Napi&scaron;i program koji slu&#269;ajnim izborom (0-9) formira matricu dimenzija <strong>m x n</strong>, a zatim prikazuje matricu i sumu elemenata svake vrste. (Re&scaron;enje) </p>
<p></p>
</body>

<!-- Mirrored from tsms.kg.edu.yu/programiranje/zadaci_c/zadaci_nizovi.htm by HTTrack Website Copier/3.x [XR&CO'2004], Fri, 10 Aug 2007 12:29:20 GMT -->
</html>
